'use strict';
/**
 * Подсчет элементов различных типов в массиве.
 * Создайте исходный массив, содержащий значения различных типов,
 * в качестве элементов, например:
 * [true, 'hello', 5, 12, -200, false, false, 'word']
 * но желательно более длинный и разнообразный.
 * Создайте объект-коллекцию (хеш) с именами типов в виде ключей
 * и 0 в качестве значения,
 * например: { number: 0, string: 0, boolean: 0 }
 * Пройдитесь по массиву циклом for..of и для каждого элемента массива,
 * увеличивайте соответствующее значение в объекте-коллекции.
 * Измените пример: удалите все ключи из начальной коллекции
 * и добавляйте их динамически в цикле.
 */

const countTypesInArray = arr => {
  const obj = {};
  for (const iter of arr) {
    const val = typeof iter;
    val in obj ? obj[val]++ : obj[val] = 1;
  }
  return obj;
};

module.exports = { countTypesInArray };
